<template>
  <section class="test" v-html="content"></section>
</template>

<script>
  import { defineComponent } from 'vue'

  const content = `{"ret":0,"msg":"OK","errorcode":0,"data":{"flag":1,"level":1,"parent_id":"0","sort":2,"name":"中华人民共和国道路交通安全法(2011修正)（上）","info":[{"type":"txt","value":"中华人民共和国道路交通安全法\n（2003年10月28日第十届全国人民代表大会常务委员会第五次会议通过　根据2007年12月29日第十届全国人民代表大会常务委员会第三十一次会议《关于修改〈中华人民共和国道路交通安全法〉的决定》第一次修正　根据2011年4月22日第十一届全国人民代表大会常务委员会第二十次会议《关于修改〈中华人民共和国道路交通安全法〉的决定》第二次修正）\n\n　　目　录\n\n　　第一章　总　则\n　　第二章　车辆和驾驶人\n　　第一节　机动车、非机动车\n　　第二节　机动车驾驶人\n　　第三章　道路通行条件\n　　第四章　道路通行规定\n　　第一节　一般规定\n　　第二节　机动车通行规定\n　　第三节　非机动车通行规定\n　　第四节　行人和乘车人通行规定\n　　第五节　高速公路的特别规定\n　　第五章　交通事故处理\n　　第六章　执法监督\n　　第七章　法律责任\n　　第八章　附　则\n\n第一章　总　则\n\n第一条 为了维护道路交通秩序，预防和减少交通事故，保护人身安全，保护公民、法人和其他组织的财产安全及其他合法权益，提高通行效率，制定本法。\n\n第二条 中华人民共和国境内的车辆驾驶人、行人、乘车人以及与道路交通活动有关的单位和个人，都应当遵守本法。\n\n第三条 道路交通安全工作，应当遵循依法管理、方便群众的原则，保障道路交通有序、安全、畅通。\n\n第四条 各级人民政府应当保障道路交通安全管理工作与经济建设和社会发展相适应。\n县级以上地方各级人民政府应当适应道路交通发展的需要，依据道路交通安全法律、法规和国家有关政策，制定道路交通安全管理规划，并组织实施。\n\n第五条 国务院公安部门负责全国道路交通安全管理工作。县级以上地方各级人民政府公安机关交通管理部门负责本行政区域内的道路交通安全管理工作。\n县级以上各级人民政府交通、建设管理部门依据各自职责，负责有关的道路交通工作。\n\n第六条 各级人民政府应当经常进行道路交通安全教育，提高公民的道路交通安全意识。\n公安机关交通管理部门及其交通警察执行职务时，应当加强道路交通安全法律、法规的宣传，并模范遵守道路交通安全法律、法规。\n机关、部队、企业事业单位、社会团体以及其他组织，应当对本单位的人员进行道路交通安全教育。\n教育行政部门、学校应当将道路交通安全教育纳入法制教育的内容。\n新闻、出版、广播、电视等有关单位，有进行道路交通安全教育的义务。\n\n第七条 对道路交通安全管理工作，应当加强科学研究，推广、使用先进的管理方法、技术、设备。\n第二章　车辆和驾驶人\n第一节　机动车、非机动车\n\n第八条 国家对机动车实行登记制度。机动车经公安机关交通管理部门登记后，方可上道路行驶。尚未登记的机动车，需要临时上道路行驶的，应当取得临时通行牌证。\n\n第九条 申请机动车登记，应当提交以下证明、凭证：\n（一）机动车所有人的身份证明；\n（二）机动车来历证明；\n（三）机动车整车出厂合格证明或者进口机动车进口凭证；\n（四）车辆购置税的完税证明或者免税凭证；\n（五）法律、行政法规规定应当在机动车登记时提交的其他证明、凭证。\n公安机关交通管理部门应当自受理申请之日起五个工作日内完成机动车登记审查工作，对符合前款规定条件的，应当发放机动车登记证书、号牌和行驶证；对不符合前款规定条件的，应当向申请人说明不予登记的理由。\n公安机关交通管理部门以外的任何单位或者个人不得发放机动车号牌或者要求机动车悬挂其他号牌，本法另有规定的除外。\n机动车登记证书、号牌、行驶证的式样由国务院公安部门规定并监制。\n\n第十条 准予登记的机动车应当符合机动车国家安全技术标准。申请机动车登记时，应当接受对该机动车的安全技术检验。但是，经国家机动车产品主管部门依据机动车国家安全技术标准认定的企业生产的机动车型，该车型的新车在出厂时经检验符合机动车国家安全技术标准，获得检验合格证的，免予安全技术检验。\n\n第十一条 驾驶机动车上道路行驶，应当悬挂机动车号牌，放置检验合格标志、保险标志，并随车携带机动车行驶证。\n机动车号牌应当按照规定悬挂并保持清晰、完整，不得故意遮挡、污损。\n任何单位和个人不得收缴、扣留机动车号牌。\n\n第十二条 有下列情形之一的，应当办理相应的登记：\n（一）机动车所有权发生转移的；\n（二）机动车登记内容变更的；\n（三）机动车用作抵押的；\n（四）机动车报废的。\n\n第十三条 对登记后上道路行驶的机动车，应当依照法律、行政法规的规定，根据`
  export default defineComponent({
    name: 'App',
    data() {
      return {
        content
      }
    }
  })
</script>

<style scoped>
.test {
  white-space: pre-wrap;
}
</style>